## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 10 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                           RESOURCE                                           |
|--------|----------------------------------------------------------------------------------------------|
| add    | `module.resolver_dns.aws_cloudwatch_log_group.route53_vpc_dns`                               |
|        | `module.resolver_dns.aws_cloudwatch_log_resource_policy.route53_vpc_dns`                     |
|        | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0]`                   |
|        | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.blocked[0]`                   |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule.allowed[0]`                          |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule.blocked[0]`                          |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule_group.firewall_rules[0]`             |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]` |
|        | `module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns`                  |
|        | `module.resolver_dns.aws_route53_resolver_query_log_config_association.route53_vpc_dns`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.resolver_dns.data.aws_iam_policy_document.route53_resolver_logging_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "route53_resolver_logging_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "route53.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.resolver_dns.aws_cloudwatch_log_group.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_group" "route53_vpc_dns" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/route53/vpc-0b4c386dbd7e50152"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_cloudwatch_log_resource_policy.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_resource_policy" "route53_vpc_dns" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "route53_resolver_logging_policy"
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0] will be created
  + resource "aws_route53_resolver_firewall_domain_list" "allowed" {
      + arn      = (known after apply)
      + domains  = [
          + "*.amazonaws.com.",
          + "*.azure.com.",
        ]
      + id       = (known after apply)
      + name     = "AllowedDomains"
      + tags     = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.blocked[0] will be created
  + resource "aws_route53_resolver_firewall_domain_list" "blocked" {
      + arn      = (known after apply)
      + domains  = [
          + "*.",
        ]
      + id       = (known after apply)
      + name     = "BlockedDomains"
      + tags     = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule.allowed[0] will be created
  + resource "aws_route53_resolver_firewall_rule" "allowed" {
      + action                             = "ALLOW"
      + firewall_domain_list_id            = (known after apply)
      + firewall_domain_redirection_action = "INSPECT_REDIRECTION_DOMAIN"
      + firewall_rule_group_id             = (known after apply)
      + id                                 = (known after apply)
      + name                               = "AllowedDomains"
      + priority                           = 100
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule.blocked[0] will be created
  + resource "aws_route53_resolver_firewall_rule" "blocked" {
      + action                             = "BLOCK"
      + block_response                     = "NODATA"
      + firewall_domain_list_id            = (known after apply)
      + firewall_domain_redirection_action = "INSPECT_REDIRECTION_DOMAIN"
      + firewall_rule_group_id             = (known after apply)
      + id                                 = (known after apply)
      + name                               = "BlockedDomains"
      + priority                           = 200
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule_group.firewall_rules[0] will be created
  + resource "aws_route53_resolver_firewall_rule_group" "firewall_rules" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "FirewallRules"
      + owner_id     = (known after apply)
      + share_status = (known after apply)
      + tags         = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0] will be created
  + resource "aws_route53_resolver_firewall_rule_group_association" "firewall_rules" {
      + arn                    = (known after apply)
      + firewall_rule_group_id = (known after apply)
      + id                     = (known after apply)
      + mutation_protection    = (known after apply)
      + name                   = "FirewallRules"
      + priority               = 101
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b4c386dbd7e50152"
    }

  # module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns will be created
  + resource "aws_route53_resolver_query_log_config" "route53_vpc_dns" {
      + arn             = (known after apply)
      + destination_arn = (known after apply)
      + id              = (known after apply)
      + name            = "route53_vpc_dns"
      + owner_id        = (known after apply)
      + share_status    = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.resolver_dns.aws_route53_resolver_query_log_config_association.route53_vpc_dns will be created
  + resource "aws_route53_resolver_query_log_config_association" "route53_vpc_dns" {
      + id                           = (known after apply)
      + resolver_query_log_config_id = (known after apply)
      + resource_id                  = "vpc-0b4c386dbd7e50152"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.n8n_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.n8n_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
